<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        /*
        |--------------------------------------------------------------------------
        | التصنيفات النهائية المعتمدة
        |--------------------------------------------------------------------------
        */

        $categories = [
            'ترفيهية',
            'تعليمية',
            'فنية',
            'رياضية',
            'دعم نفسي',
            'حماية الطفل',
        ];


        /*
        |--------------------------------------------------------------------------
        | حذف أي تصنيفات غير معتمدة
        |--------------------------------------------------------------------------
        */

        Category::whereNotIn(
            'name',
            $categories
        )->delete();


        /*
        |--------------------------------------------------------------------------
        | إنشاء / تحديث التصنيفات المعتمدة
        |--------------------------------------------------------------------------
        */

        foreach ($categories as $category) {

            Category::updateOrCreate(
                [
                    'name' => $category,
                ]
            );
        }
    }
}